# Задача 1. Аналитик собрал статистику за 36 прошедших месяцев, согласно 
# которой вложение в акцию компании АВС позволило за месяц заработать 15% 
# в 1 случае из 36 проанализированных месяцев, 10% - в 2 случаях, 5% - в 
# 3 случаях, 0% в 23 случаях, потерять 5% в 6 случаях, и потерять 10% в 
# оставшихся случаях. Определить ожидаемое значение доходности инвестиции.

# Задача 2. Инвестиционный фонд за 7 предыдущих лет заработал следующие 
# годовые доходности: +5%; -2%; +12%; +7%; -4%; +11%; +9%. Если предположить, 
# что в среднем фонд будет зарабатывать такую же доходность, как и по итогам 
# прошедших 7 лет (в смысле геометрической доходности), и вложить $100 тыс. 
# в этот фонд, то какой ожидаемый результат будет через 5 лет?

# Задача 3. В инвестиционном анализе есть т.н. показатель Шарпа, который 
# характеризует эффективность инвестиции в фонд. Он рассчитывается как 
# отношение средней доходности к риску (волатильности). Рассчитайте этот 
# коэффициент для условий задачи 2.

# Задача 4. Компания по страхованию автомобилей разделяет водителей по трем 
# категориям в зависимости от опыта: категория 1 (стаж вождения более 10 лет), 
# категория 2 (стаж более 2 лет, но меньше 10), категория 3 (стаж менее 2 лет).
# Для данной компании среди 100% застрахованных 30% принадлежат категории 1, 
# 50% – категории 2, 20% – категории 3. Вероятность того, что в течение года 
# водитель категории 1 попадет хотя бы в одно ДТП равна 1%; для водителя 
# категории 2 - 3%, а для водителя категории 3 – 10%. Клиент компании 
# застраховал автомобиль и попал в ДТП. Какова вероятность того, что он 
# относится к категории 1?

# Задача 5. Аналитик собрал статистические данные между ценой акции 
# перерабатывающей компании и ценой ресурса, который эта компания 
# перерабатывает:
# Месяц 1 2 3 4 5 6 7 8 9 10 11 12
# Цена акции, 
# $ 12,1 15,2 15,3 15,7 15,2 16,1 16,5 17,1 17,2 17,0 16,8 16,9
# Цена ресурса, 
# $ 115,0 119,0 121,0 130,0 131,0 150,0 155,0 172,0 174,0 168,0 161,0 159,0
# И предположил, что цена акции зависит от цены ресурса с задержкой на 
# 2 месяца. Определить уравнение регрессии для этого предположения и сделать 
# на его основе прогноз цены акции на 14 месяц.